package com.supporter.prj.eip.code_share.entity.base;

// ~ File Information
// ====================================================================================================================

/**
 * 流水号实体类的接口类.
 * 
 * @author 康博
 * @createDate 2017-5-22
 * @since 6.0
 *
 */
public interface ISerialNoEntity {

	// ~ Static Fields
	// ================================================================================================================

	// ~ Methods
	// ================================================================================================================

	/**
	 * 获得顺序号.
	 * 
	 * @return
	 */
	int getIndexNo();
	
	/**
	 * 设置顺序号.
	 * 
	 * @param indexNo
	 */
	void setIndexNo(int indexNo);
}
